CSI API ETABS v1
cFrameObj.GetDesignProcedure Method
 Retrieves the design procedure for a frame object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDesignProcedure(
	string Name,
	ref int MyType
)
Function GetDesignProcedure (
	Name As String,
	ByRef MyType As Integer
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim MyType As Integer
Dim returnValue As Integer
returnValue = instance.GetDesignProcedure(Name,
	MyType)
int GetDesignProcedure(
	String^ Name,
	int% MyType
)
abstract GetDesignProcedure :
        Name : string *
        MyType : int byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame object
MyType
Type: System.Int32
 This is an integer from the list below, indicating the design procedure type of the specified frame object.
Program determined = 0
Steel Frame Design = 1
Concrete Frame Design = 2
Composite Beam Design = 3
Steel Joist Design = 4
No Design = 7
Composite Column Design = 13
Return Value
Type: Int32
 Returns zero if the design procedure is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim MyType as Integer
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set design procedure
   ret = SapModel.FrameObj.GetDesignProcedure("8", MyType)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace